/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.4                                                               */
/*  Start_time: 08.08.2022 16:45                                                  */
/*  End_time: 08.08.2022 16:58                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для перевода температур по Цельсию в
 * шкалу Фаренгейта и вывода соответствующей таблицы.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
  float fahr, celsius;
  int lower, upper, step;

  lower = 0;
  upper = 300;
  step = 20;

  celsius = lower;
  while (celsius <= upper) {
    fahr = celsius * (9.0 / 5.0) + 32.0;
    printf("%3.0f %7.2f\n", celsius, fahr);
    celsius = celsius + step;
  }
}
