/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.8                                                               */
/*  Start_time: 08.08.2022 21:09                                                  */
/*  End_time: 08.08.2022 21:16                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для подсчета пробелов, знаков табуляции
 * и символов конца строки.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
  int c;
  int ns, nt, nl;

  ns = nt = nl = 0;
  while ((c = getchar()) != EOF) {
    if (c == ' ') {
      ++ns;
    }
    if (c == '\t') {
      ++nt;
    }
    if (c == '\n') {
      ++nl;
    }
  }
    printf("ns = %d, nt = %d, nl = %d\n", ns, nt, nl);
}
