/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.9                                                               */
/*  Start_time: 08.08.2022 21:16                                                  */
/*  End_time: 09.08.2022 13:01                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для копирования входного потока в выходной с
 * заменой каждой строки, состоящей из одного или нескольких пробелов,
 * одним пробелом.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>
  int c;
  int flag = 0;

int main() {
  while ((c = getchar()) != EOF) {
    if (c == ' ') {
      if (flag == 0) {
        putchar(c);
        flag = 1;
      }
    }
    if (c != ' ') {
      putchar(c);
      flag = 0;
    }
  }
}
