/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.9                                                               */
/*  Start_time: 08.08.2022 21:16                                                  */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для копирования входного потока в выходной с
 * заменой каждой строки, состоящей из дного или нескольких пробелов,
 * одним пробелом.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
}
