/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.10                                                              */
/*  Start_time: 09.08.2022 13:03                                                  */
/*  End_time: 09.08.2022 13:24                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для копирования входного потока в выходной с заменой знаков
 * табуляции на \t, символов возврата назад (Backspace) на \b, а обратных косых
 * черт - на \\. Это сделает табуляции и символы возврата легко четаемыми в потоке.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
  int c;
  int flag;

  while ((c = getchar()) != EOF) {
    flag = 0;
    if (c == '\t') {
      flag = 1;
      printf("\\t");
    }
    if (c == '\b') {
      flag = 1;
      printf("\\b");
    }
    if (c == '\\') {
      flag = 1;
      printf("\\\\");
    }
    if (flag == 0) {
      putchar(c);
    }
  }
}
