/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.10                                                              */
/*  Start_time: 09.08.2022 13:03                                                  */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для копирования входного потока в выходной с заменой знаков
 * табуляции на \t, символов возврата назад (Backspace) на \b, а обратных косых
 * черт - на \\. Это сделает табуляции и символы возврата легко четаемыми в потоке.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
}
