/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.11                                                              */
/*  Start_time: 09.08.2022 16:43                                                  */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Как бы вы протестировали программу подсчета слов? Какого рода
 * входной поток скорее всего выявит ошибки в программе (если таковые есть)?
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

#define IN 1
#define OUT 0

int main() {
  int c, state;
  int nl, nw, nc;

  state = OUT;
  nl = nw = nc = 0;
  while ((c = getchar()) != EOF) {
    ++nc;
    if (c == '\n') {
      ++nl;
    }
    if (c == ' ' || c == '\t' || c == '\n') {
      state = OUT;
    } else if (state == OUT) {
      state = IN;
      ++nw;
    }
  }
  printf("%d %d %d\n", nl, nw, nc);
}
