/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.12                                                              */
/*  Start_time: 09.08.2022 18:50                                                  */
/*  End_time: 09.08.2022 19:06                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для вывода входного потока по одному слову в строке.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

#define IN 1
#define OUT 0

int main() {
  int c, state;

  state = OUT;
  while ((c = getchar()) != EOF) {
    if (c == ' ' || c == '\t' || c == '\n') {
      if (state == IN) {
        printf("\n");
        state = OUT;
      }
    } else {
      state = IN;
      putchar(c);
    }
  }
}
