/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.13                                                              */
/*  Start_time: 10.08.2022 14:48                                                  */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для вывода гистограммы длин слов во входном потоке. Построить
 * гистограмму с горизонтальными рядами довольно легко, а вот с вертикальными
 * столбцами труднее.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
}
