/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.14                                                              */
/*  Start_time: 10.08.2022 18:19                                                  */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для вывода гистограммы частот, с которыми
 * встречаются во входним потоке различные символы.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
}
