/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.14                                                              */
/*  Start_time: 10.08.2022 18:19                                                  */
/*  End_time: 11.08.2022 10:37                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Напишите программу для вывода гистограммы частот, с которыми
 * встречаются во входним потоке различные символы.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
  int c;
  int ch[256];

  for (int i = 0; i < 256; ++i) {
    ch[i] = 0;
  }

  while ((c = getchar()) != EOF) {
    ++ch[c];
  }

  for (int i = 0; i < 256; ++i) {
    if (ch[i] > 0) {
      if(i >= 32)
        printf("Симв. '%2c' - ", i);
      else
        printf("Код   '%2d' - ", i);
      for(int j = 0; j < ch[i]; ++j) {
        putchar('#');
      }
      putchar('\n');
    }
  }
}
