/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: 1.3                                                                   */
/*  Start_time: 08.08.2022 16:19                                                  */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Модифицируйте программу преобразования температур так,
 * чтобы она выводила заголовок над таблицей.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
}
