/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.5                                                               */
/*  Start_time: 08.08.2022 17:17                                                  */
/*  End_time: 08.08.2022 17:23                                                    */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Доработайте программу преобразования температур так, чтобы она выводила
 * таблицу в обратном порядке, то есть от 300 градусов до нуля.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
  int fahr;

  for(fahr = 300; fahr >= 0; fahr = fahr - 20) {
    printf("%3d %6.1f\n", fahr, (5.0/9.0) * (fahr-32));
  }
}
