/*================================================================================*/
/*    The C Programming Language by Brian W. Kernighan and Dennis M. Ritchie      */
/*================================================================================*/
/*  Tittle: Ex. 1.5                                                               */
/*  Start_time: 08.08.2022 17:17                                                  */
/*  End_time:                                                                     */
/*  Note:                                                                         */
/*================================================================================*/

/*<===============================Problem_Statement==============================>*/

/*
 * Доработайте программу преобразования температур так, чтобы она выводила
 * таблицу в обратном порядке, то есть от 300 градусов до нуля.
 *
 */

/*<=====================================CODE=====================================>*/

#include <stdio.h>

int main() {
  
}
